Tekla Open API Reference for Tekla Structures 2025
DrawingObject.GetView Method
 Gets the view where the drawing object is.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewBase GetView()
Public Function GetView As ViewBase
Return Value
Type: ViewBase
The view where the drawing object is.
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace